models.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-22 Wed 18:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Overview of laptop models</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Andrew Hooke" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Overview of laptop models</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7703afc">Thinkpads (Lenovo/IBM)</a>
<ul>
<li><a href="#orge9654ee">T Models</a>
<ul>
<li><a href="#orgfdd77d3">T43 and earlier</a></li>
<li><a href="#orgf86e01c">T60</a></li>
<li><a href="#orgf3a6c5c">T61</a></li>
<li><a href="#orge96df81">T400</a></li>
<li><a href="#orgb509320">T500</a></li>
<li><a href="#org7b73a37">T410</a></li>
<li><a href="#orge442d72">T420</a></li>
<li><a href="#orgd7508c9">T430</a></li>
</ul>
</li>
<li><a href="#org8b63e88">X Models</a>
<ul>
<li><a href="#org6686962">x61</a></li>
<li><a href="#org6da131c">x200</a></li>
<li><a href="#org1ec096a">x201</a></li>
</ul>
</li>
<li><a href="#org15685fb">W Models</a></li>
<li><a href="#orgf5813b3">New Models</a></li>
</ul>
</li>
<li><a href="#orga9dc28b">Dell</a>
<ul>
<li><a href="#orgf6be8a6">Latitude Series</a></li>
<li><a href="#orgeba8d90">Inspiron Series</a></li>
<li><a href="#org1345e94">XPS Series</a></li>
<li><a href="#org5425b29">Precision Series</a></li>
</ul>
</li>
<li><a href="#org81fc2e9">HP</a>
<ul>
<li><a href="#org11af4ee">Older HP stuff</a></li>
<li><a href="#org459fa0f">Newer HP stuff</a></li>
</ul>
</li>
<li><a href="#orgc26a1bf">Acer</a>
<ul>
<li><a href="#orga803484">Chromebooks</a></li>
<li><a href="#org636799d">Non-Chromebooks</a></li>
</ul>
</li>
<li><a href="#orgf7a0e29">Apple</a>
<ul>
<li><a href="#org81ad8a7">Old Apple Laptops</a></li>
<li><a href="#org2b5f301">New Apple Laptops</a></li>
</ul>
</li>
<li><a href="#org8b9b99d">Framework</a></li>
<li><a href="#org1683c68">MNT Reform</a></li>
</ul>
</div>
</div>
<p><a href="https://zjquid.github.io/index.html">Homepage</a>
<div id="outline-container-org7703afc" class="outline-2">
<h2 id="org7703afc">Thinkpads (Lenovo/IBM)</h2>
<div class="outline-text-2" id="text-org7703afc">
</div>
<div id="outline-container-orge9654ee" class="outline-3">
<h3 id="orge9654ee">T Models</h3>
<div class="outline-text-3" id="text-orge9654ee">
</div>
<div id="outline-container-orgfdd77d3" class="outline-4">
<h4 id="orgfdd77d3">T43 and earlier</h4>
<div class="outline-text-4" id="text-orgfdd77d3">
<p>
Only 32 bit and have those hard drives with a million pins instead of SATA. Not worth purchasing unless you're an enthusiast.
</p>
</div>
</div>
<div id="outline-container-orgf86e01c" class="outline-4">
<h4 id="orgf86e01c">T60</h4>
<div class="outline-text-4" id="text-orgf86e01c">
<p>
The T60 is pretty interesting. Wide range of specs, most of which can be upgraded to match a T61. Not really any better than a T61.
</p>
</div>
</div>
<div id="outline-container-orgf3a6c5c" class="outline-4">
<h4 id="orgf3a6c5c">T61</h4>
<div class="outline-text-4" id="text-orgf3a6c5c">
<p>
The last 4:3 Thinkpad. Avoid the models with the Nvidia GPU, as it typically fries the motherboard after a few years&#x2026; since the T61 is from 2007, those models are ticking time bombs. That being said, I have two of them and they're fine. The high res panel (1400x1050) is pretty nice for its age.
</p>
</div>
</div>
<div id="outline-container-orge96df81" class="outline-4">
<h4 id="orge96df81">T400</h4>
<div class="outline-text-4" id="text-orge96df81">
<p>
The high res model is nice, avoid the 800p models. Pretty solid with the P8600 processor (more on this under the entry for the x200). DDR3 ram shows a significant improvement over the T61, as well as having a much more efficient processor. The T400/T500/W500/W700 don't have two-finger scrolling, only edge scrolling, which is incredibly disappointing. There is a workaround on Windows, however.
</p>
</div>
</div>
<div id="outline-container-orgb509320" class="outline-4">
<h4 id="orgb509320">T500</h4>
<div class="outline-text-4" id="text-orgb509320">
<p>
Great panel for such an old laptop. Typically has the higher spec Penryn core 2 duo processors: they run hot but are pretty good. One of my favorite Thinkpads, love the 15 inch 16:10 display.
</p>
</div>
</div>
<div id="outline-container-org7b73a37" class="outline-4">
<h4 id="org7b73a37">T410</h4>
<div class="outline-text-4" id="text-org7b73a37">
<p>
Basically just a T400 with two-finger scrolling. The first-gen Core i processors aren't great.
</p>
</div>
</div>
<div id="outline-container-orge442d72" class="outline-4">
<h4 id="orge442d72">T420</h4>
<div class="outline-text-4" id="text-orge442d72">
<p>
Classic, first Thinkpad with a 16:9 display.
</p>
</div>
</div>
<div id="outline-container-orgd7508c9" class="outline-4">
<h4 id="orgd7508c9">T430</h4>
<div class="outline-text-4" id="text-orgd7508c9">
<p>
Just a better T420, has a mini displayport, better battery, and the Ivybridge processors are a huge step up from Sandybridge.
</p>
</div>
</div>
</div>
<div id="outline-container-org8b63e88" class="outline-3">
<h3 id="org8b63e88">X Models</h3>
<div class="outline-text-3" id="text-org8b63e88">
</div>
<div id="outline-container-org6686962" class="outline-4">
<h4 id="org6686962">x61</h4>
</div>
<div id="outline-container-org6da131c" class="outline-4">
<h4 id="org6da131c">x200</h4>
<div class="outline-text-4" id="text-org6da131c">
<p>
The best thinkpad ever made. The core 2 duo P8600 is perfect, uses battery pretty efficiently, fast enough for most daily usage, and stays very cool&#x2026; even cooler than the midrange Ivybridge processors. 16:10 display.
</p>
</div>
</div>
<div id="outline-container-org1ec096a" class="outline-4">
<h4 id="org1ec096a">x201</h4>
<div class="outline-text-4" id="text-org1ec096a">
<p>
Basically the same as the x200, but with the first gen Core i processors and a trackpad. The trackpad is the best trackpad I've ever used (although I don't think gestures would translate well on it, if gestures are important to you). Gets hotter than the x200, with similar performance, and worse battery life. Stick to the x200, although the x201 is still a great choice (I have two of them).
</p>
</div>
</div>
</div>
<div id="outline-container-org15685fb" class="outline-3">
<h3 id="org15685fb">W Models</h3>
<div class="outline-text-3" id="text-org15685fb">
<p>
Just the 15 inch T models with better graphics, and sometimes better panels.
</p>
</div>
</div>
<div id="outline-container-orgf5813b3" class="outline-3">
<h3 id="orgf5813b3">New Models</h3>
<div class="outline-text-3" id="text-orgf5813b3">
<p>
Avoid. Build quality is much worse than it used to be, Lenovo is no longer the best on the market.
</p>
</div>
</div>
</div>
<div id="outline-container-orga9dc28b" class="outline-2">
<h2 id="orga9dc28b">Dell</h2>
<div class="outline-text-2" id="text-orga9dc28b">
</div>
<div id="outline-container-orgf6be8a6" class="outline-3">
<h3 id="orgf6be8a6">Latitude Series</h3>
<div class="outline-text-3" id="text-orgf6be8a6">
<p>
The Dell Latitude is typically decent. I've worked on the X300, D420, and some 15 inch Latitude with an 8th gen i7. The build quality on the older models are much better, but still remains defeated by old Thinkpads. The 8th gen i7 Latitude was very cheap feeling and flexible, no idea about newer models.
</p>
</div>
</div>
<div id="outline-container-orgeba8d90" class="outline-3">
<h3 id="orgeba8d90">Inspiron Series</h3>
<div class="outline-text-3" id="text-orgeba8d90">
<p>
Generally pretty crap, but can be cheap. Sufficient for attaching to a monitor and playing retro games.
</p>
</div>
</div>
<div id="outline-container-org1345e94" class="outline-3">
<h3 id="org1345e94">XPS Series</h3>
<div class="outline-text-3" id="text-org1345e94">
<p>
The new Dell XPS laptops I've seen at microcenter seem to be very solid and nice, at the cost of having only USB C ports and all parts soldered.
</p>
</div>
</div>
<div id="outline-container-org5425b29" class="outline-3">
<h3 id="org5425b29">Precision Series</h3>
<div class="outline-text-3" id="text-org5425b29">
<p>
I know nothing about these.
</p>
</div>
</div>
</div>
<div id="outline-container-org81fc2e9" class="outline-2">
<h2 id="org81fc2e9">HP</h2>
<div class="outline-text-2" id="text-org81fc2e9">
</div>
<div id="outline-container-org11af4ee" class="outline-3">
<h3 id="org11af4ee">Older HP stuff</h3>
<div class="outline-text-3" id="text-org11af4ee">
<p>
Elitebooks etc. used to be nice.
</p>
</div>
</div>
<div id="outline-container-org459fa0f" class="outline-3">
<h3 id="org459fa0f">Newer HP stuff</h3>
<div class="outline-text-3" id="text-org459fa0f">
<p>
New HP is garbage. Avoid.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc26a1bf" class="outline-2">
<h2 id="orgc26a1bf">Acer</h2>
<div class="outline-text-2" id="text-orgc26a1bf">
</div>
<div id="outline-container-orga803484" class="outline-3">
<h3 id="orga803484">Chromebooks</h3>
<div class="outline-text-3" id="text-orga803484">
<p>
Acer Chromebooks are not the worst thing ever&#x2026; lots of coreboot support, and sometimes have decent screens. The Acer R11 is pretty nice, 768p IPS with a mini m.2 ssd and no fan; it has sufficient ports, including an HDMI. If you can find these for cheap, grab one, I use one for watching movies in hotel rooms through HDMI. Some of the newer Chromebooks have soldered on memory&#x2026; usually around 32gb!! AVOID&#x2026; although I did buy one for cheap with a 1080p IPS&#x2026; will be my new hotel-movie-laptop, because I store the movies on a flash drive anyways.
</p>
</div>
</div>
<div id="outline-container-org636799d" class="outline-3">
<h3 id="org636799d">Non-Chromebooks</h3>
<div class="outline-text-3" id="text-org636799d">
<p>
They're all crap, avoid.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf7a0e29" class="outline-2">
<h2 id="orgf7a0e29">Apple</h2>
<div class="outline-text-2" id="text-orgf7a0e29">
</div>
<div id="outline-container-org81ad8a7" class="outline-3">
<h3 id="org81ad8a7">Old Apple Laptops</h3>
<div class="outline-text-3" id="text-org81ad8a7">
<p>
"Old" means any model that doesn't look like the stuff they sell currently. <br />
</p>

<p>
Usually overpriced, thrift stores see the Apple logo and think it's worth it's weight in gold. The core 2 duo models (the white polycarbonate macbooks) are okay, but I think the main appeal for me is nostalgia. Otherwise, they get very hot, the motherboard is very difficult (on purpose) to remove and clean, and I think they even use DDR2 ram. The displays are usually solid though. I use mine to run an iMessage server.
</p>
</div>
</div>
<div id="outline-container-org2b5f301" class="outline-3">
<h3 id="org2b5f301">New Apple Laptops</h3>
<div class="outline-text-3" id="text-org2b5f301">
<p>
"New" means any model that uses the aluminum design they've used for the last decase or so&#x2026; pretty much started at the beginning of the Core i processors. <br />
</p>

<p>
Mainly garbage. If Mac OSX is a necessity, get a cheap macbook pro without the crappy butterfly swtiches with an ssd and pay someone to repaste the processor. <br />
</p>

<p>
The new M1 macbooks are interesting, hope other manufacturers try their hand at ARM laptops.
</p>
</div>
</div>
</div>

<div id="outline-container-org8b9b99d" class="outline-2">
<h2 id="org8b9b99d">Framework</h2>
<div class="outline-text-2" id="text-org8b9b99d">
<p>
more on this later&#x2026;
</p>
</div>
</div>
<div id="outline-container-org1683c68" class="outline-2">
<h2 id="org1683c68">MNT Reform</h2>
<div class="outline-text-2" id="text-org1683c68">
<p>
Meme laptop. I do not recommend it, but you do you.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Andrew Hooke</p>
<p class="date">Created: 2021-12-22 Wed 18:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
